fast_finish_2026/LR5/webapp/runs/2026-09-12T23-50-01-637Z/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       22000;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       22400;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       25600;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       25800;
    }
)

// ************************************************************************* //
